import numpy as np

arr = np.array([[ 1,  2,  3,  4,  5],
                [ 6,  7,  8,  9, 10],
                [11, 12, 13, 14, 15],
                [16, 17, 18, 19, 20],
                [21, 22, 23, 24, 25]])


# 행과 열을 특정 범위로 슬라이싱
# 1~3번째 행과 2~4번째 열 선택
num_1 =
print("\n1~3번째 행과 2~4번째 열 선택:")
print(num_1)

# 출력 예상:
# [[ 8  9 10]
#  [13 14 15]
#  [18 19 20]]

# 조건에 맞는 슬라이싱 (짝수인 값만 선택)
num_2 = 
print("\n배열에서 짝수만 선택:")
print(num_2)

# 출력 예상:
# [ 2 4 6 8 10 12 14 16 18 20 22 24]


# 역방향으로 배열 슬라이싱
num_3 =
print("\n배열을 반대로 뒤집은 결과:")
print(num_3)

# 출력 예상:
# [[25 24 23 22 21]
#  [20 19 18 17 16]
#  [15 14 13 12 11]
#  [10  9  8  7  6]
#  [ 5  4  3  2  1]]
